<template>
  <div class="about">
    <div class="article">
      <h1>About</h1>

      <h2>このソフトのコンセプト</h2>
      <p>
        世の中には様々なファイルフォーマットがあります。そしてそれらがたくさんあることによって初心者に
        とっては、「なんだこのファイル開けないぞ」なんてこともありました。そこで生まれたソフトがあります。
        <a href="https://ffmpeg.org">FFmpeg</a>
        です。しかしこのソフトはコマンドラインでの操作のみで、コマンドラインでの操作に慣れていない人は、
        使いずらく感じることもあります。そこで僕はGUIでFFmpegの便利な機能を最大限に使えるようにするために
        このソフトウェアを開発してきました。
      </p>

      <h2>将来的に</h2>
      <p>
        いまはこのソフトはMP4に変換するだけですがこれから先は、ファイルのコーデックなどを細かく設定したり、
        僕の開発が途中で止まってしまっているソフトとの統合をしていきたいです。
      </p>
    </div>
  </div>
</template>

<style lang="scss">
.about {
  padding: 5px;
}
</style>
